Revit 2027 API
FabricationConfiguration.CanUnloadItemFiles Method
 Checks if the fabrication item files are already in use and should not be unloaded.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanUnloadItemFiles(
	IList<FabricationItemFile> itemFiles
)
Public Function CanUnloadItemFiles (
	itemFiles As IList(Of FabricationItemFile)
) As Boolean
public:
bool CanUnloadItemFiles(
	IList<FabricationItemFile^>^ itemFiles
)
member CanUnloadItemFiles :
        itemFiles : IList<FabricationItemFile> -> bool
Parameters
itemFiles IList<FabricationItemFile>
 The fabrication item files to unload.
Return Value
Boolean
 Returns true if the fabrication item files can be unloaded, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace